Autodesk.Revit.DB.DirectContext3D.IndexPrimitive.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.IndexPrimitive
The base class for index buffer primitives.
Since:
2017